In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# Load taxi data from January 2019 into a data frame, 
# using only the columns `tpep_pickup_datetime`, `passenger_count`, `trip_distance`, and `total_amount`, 
# making sure to load `tpep_pickup_datetime` as `datetime`.

filename = '../data/nyc_taxi_2019-07.csv'

df = pd.read_csv(filename,
                usecols=['tpep_pickup_datetime', 
                         'trip_distance', 
                         'passenger_count', 
                         'total_amount'],
                 parse_dates=['tpep_pickup_datetime'])

df.head()

  tpep_pickup_datetime  passenger_count  trip_distance  total_amount
0  2019-07-01 00:51:04              1.0           0.00          4.94
1  2019-07-01 00:46:04              1.0           4.16         20.30
2  2019-07-01 00:25:09              1.0          18.80         70.67
3  2019-07-01 00:33:32              1.0          18.46         66.36
4  2019-07-01 00:00:55              0.0           1.70         15.30

In [3]:
# Export, to a tab-delimited CSV file, the columns tpep_pickup_datetime, passenger_count, trip_distance, total_amount
# Use the format day/month/year HHs:MMm:SSs

dt_format='%d/%m/%Y %Hh:%Mm:%Ss'

df.to_csv('ex40_taxi_07_2019.csv',
         sep='\t',
         columns=['tpep_pickup_datetime', 
                  'passenger_count', 
                  'trip_distance',
                  'total_amount'],
         date_format=dt_format)

In [5]:
# Read the CSV file that we just created into a data frame. 
# make sure to parse the datetime column (tpep_pickup_datetime) in its current format

df = (
    pd
    .read_csv('ex40_taxi_07_2019.csv',
              sep='\t',
              usecols=['tpep_pickup_datetime', 
                       'passenger_count', 
                       'trip_distance', 
                       'total_amount'],
           parse_dates=['tpep_pickup_datetime'],
           date_format=dt_format)
)

In [6]:
# Check that the 'export_date' column is indeed a datetime
df.dtypes

tpep_pickup_datetime    datetime64[ns]
passenger_count                float64
trip_distance                  float64
total_amount                   float64
dtype: object

In [22]:
all_dfs = pd.read_html('https://en.wikipedia.org/wiki/Apollo_program')
df = all_dfs[2].copy()[['Date', 'Designation']]

In [23]:
df['Date'] = pd.to_datetime(df['Date'].str.replace(
        '(â€“.+)?,', '', regex=True))

In [24]:
df = df.set_index('Date')

In [25]:
df

                  Designation
Date
1966-02-26             AS-201
1966-07-05             AS-203
1966-08-25             AS-202
1967-02-21  AS-204 (Apollo 1)
1967-11-09           Apollo 4
1968-01-22           Apollo 5
1968-04-04           Apollo 6
1968-10-11           Apollo 7
1968-12-21           Apollo 8
1969-03-03           Apollo 9
1969-05-18          Apollo 10
1969-07-16          Apollo 11
1969-11-14          Apollo 12
1970-04-11          Apollo 13
1971-01-31          Apollo 14
1971-07-26          Apollo 15
1972-04-16          Apollo 16
1972-12-07          Apollo 17

In [26]:
len(df)

18